
local m = {}

--根据人数来决定当前BOSS的血量倍数
m.hpbs={
  1,
  1.7,
  2.4,
  3.2,
}
m.level={
  31,
  61,
  91,
  121,
  151,
  181,


}
m.attackbs={
  1,
  1.3,
  1.6,
  2,
}
m.name={
  "npc_dota_endboss_02";
  "npc_boss_02";
  "npc_boss_03";
  "npc_boss_04";
  "npc_boss_05";
  "npc_boss_06";
  --  "npc_boss_07";
 -- "npc_boss_08";
}
m.hp={
  200000,
  800000,
  3200000,
  7500000,
  7500000,
  7500000,
}
--怪物名字对应的怪物的血量系数
--怪物的血量= 当前波数的血量 * 怪物的血量系数*难度血量系数*人数
m.hpxs={
  npc_dota_endboss_02= 1.5 ;
  npc_boss_02=1.5;
  npc_boss_03=1.5;
  npc_boss_04=1.5;
  npc_boss_05=1.5;
  npc_boss_06=1.8;
  npc_boss_07=2;
  npc_boss_08=1.6;
}

m.armor={
  42;
  105;
  225;
  450;
  1500;
  4400
}

--怪物名字对应的怪物的护甲系数
--怪物的护甲= 当前波数的护甲 * 怪物的护甲系数*难度护甲系数
m.armorxs={
 npc_dota_endboss_02= 1.1 ;
  npc_boss_02=1.1;
  npc_boss_03=1;
  npc_boss_04=1.1;
  npc_boss_05=1.1;
  npc_boss_06=1.1;
  npc_boss_07=1.1;
  npc_boss_08=1.1;
}
--boss魔抗
m.mk={
  70;
  80;
  90;
  95;
  90;
  90;
}

m.mkxs={
 npc_dota_endboss_02= 2 ;
  npc_boss_02=1.2;
  npc_boss_03=1.2;
  npc_boss_04=1.3;
  npc_boss_05=1.3;
  npc_boss_06=1.3;
  npc_boss_07=1.5;
  npc_boss_08=1.8;

}

m.attackmin={
  3400;
  9000;
  40000;
  100000;
  344000;
  940000;
}
m.attackmax={
  6800;
  18000;
  80000;
  250000;
  640000;
  1600000;
}

--怪物名字对应的怪物的攻击系数
--怪物的攻击= 当前波数的攻击 * 怪物的攻击系数*难度攻击系数
m.attackxs={
  npc_dota_endboss_02= 10 ;
  npc_boss_02=6.5;
  npc_boss_03=1.6;
  npc_boss_04=2.6;
  npc_boss_05=2;
  npc_boss_06=2;
  npc_boss_07=3;
  npc_boss_08=4;
}



m.gold={
  10000,
  30000,
  50000,
  80000,
  100000,
  100000,
}





m.xp={
  10000,
  30000,
  50000,
  80000,
  100000,
  100000,
}

--每个难度代表的最低和最高的品质装备，,从现在开始不会再有白色品质1的装备
m.difficultyconfig={
    [1]={2,5}; 
    [2]={3,6};
    [3]={3,7};

    [4]={2,5};
    [5]={3,6};
    [6]={3,7};
    [7]={4,7};
    
    [8]={3,4};
    [9]={3,5};
    [10]={3,6};
    [11]={4,6};
    [12]={4,6};
    [13]={4,7};
    [14]={5,7};

    [15]={3,5};
    [16]={3,5};
    [17]={3,6};
    [18]={4,6};
    [19]={4,6};
    [20]={4,7};
    [21]={4,7};
    [22]={5,7};

    [23]={3,6};
    [24]={3,6};
    [25]={4,6};
    [26]={4,6};
    [27]={4,7};
    [28]={4,7};
    [29]={5,7};


}

--存档装备每阶的权重
m.netbl1={
    144,
    72,
    36,
    18,
    9,
    3,
    1
}
m.netbl2={
    1200,
    400,
    150,
    50,
    25,
    5,
    1
}
--2级宝箱品质权重
m.netboxbl2={
    1000000,
    100000,
    10000,
    1000,
    100,
    10,
    1
}
m.netbl3={
    10000,
    2000,
    600,
    200,
    42,
    7,
    1
}
--3级宝箱品质权重
m.netboxbl3={
    1200000,
    120000,
    12000,
    1200,
    120,
    12,
    1
}

m.netbl4={
    10800,
    3600,
    1200,
    300,
    64,
    8,
    1
}
--4级宝箱品质权重
m.netboxbl4={
    1000000,
    100000,
    50625,
    3375,
    225,
    15,
    1
}


m.netbl5={
    4000000,
    400000,
    40000,
    4000,
    400,
    20,
    1
}
--4级宝箱品质权重
m.netboxbl5={
    1000000,
    100000,
    50625,
    3375,
    225,
    15,
    1
}

--每个难度的爆率加成，好像用不到，因为已经有保底了
m.difficultyndjc={
    [1]={1},
    [2]={1.5},
    [3]={2},
    [4]={2.5},
    [5]={3},


}

--每个难度的最低和最高 等阶 装备
m.difficultyzgdj={
    [1]={1,2};
    [2]={1,2};
    [3]={1,2};

    [4]={2,3};
    [5]={2,3};
    [6]={2,3};
    [7]={2,3};

    [8]={3,3};
    [9]={3,3};
    [10]={3,3};
    [11]={3,3};
    [12]={3,3};
    [13]={3,3};
    [14]={3,3};

    [15]={4,4};
    [16]={4,4};
    [17]={4,4};
    [18]={4,4};
    [19]={4,4};
    [20]={4,4};
    [21]={4,4};
    [22]={4,4};

    [23]={5,5};
    [24]={5,5};
    [25]={5,5};
    [26]={5,5};
    [27]={5,5};
    [28]={5,5};
    [29]={5,5};
  
}
  
--难度晶石加成
  m.ndjsjc={
    1,
    1.1,
    1.2,

    1.4,
    1.6,
    1.8,
    2,

    2.3,
    2.6,
    2.9,
    3.2,
    3.5,
    3.8,
    4.1,

    4.5,
    4.9,
    5.3,
    5.7,
    6.1,
    6.5,
    6.9,
    7.3,

    7.8,
    8.3,
    8.8,
    9.3,
    9.8,
    10.3,
    10.8,


}




return m
